DataProcessors/ПриемкаКоллективная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПриемкаКоллективная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемкиГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаОтВнешнегоПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСостояниеКодаВЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСоответствиеКодаТоваруПоGTIN</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПриниматьКМБезПроверкиСостояния</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверятьКодыСОжидаемымиПриПриемке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПриемкаКоллективная/Forms/ФормаРазмещениеТовара/Ext/Form/Module.bsl
&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборЯчейки");
	ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЗРучнойНабор()
	
	РучнойВводКоличества.Очистить();
	СтрокаТЗ = РучнойВводКоличества.Добавить();
	СтрокаТЗ.Заголовок = "Кол.:";
	СтрокаТЗ.ЗнакБольше = ">";
	СтрокаТЗ.ЗнакМеньше = "<";
	СтрокаТЗ.ВведенноеКоличествоВРучную = 1;
	Элементы.РучнойВводКоличества.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыСДокументомПТУ();	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);
		
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;	
	
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();	
	Элементы.СписокТоваровВБуфереРазмещения.Обновить();	
	
	Оповестить("ДоступностьГруппыЯчейка", Новый Структура("Состояние", "ВыборЯчейки"));
	Оповестить("ГруппаПоискаТовара", Ложь);
	Оповестить("ОбновитьГруппуОсталостьИНабрано");
		
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбщегоНазначенияКлиент.ЗаполнитьТЧКнопокДляШКнеНайден(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли; 
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОсновная;
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;
		КонецЕсли; 
		
		СтатусРаботыСРазмещениемДокумента = ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента();
		Если СтатусРаботыСРазмещениемДокумента = "ВыборЯчейки" Тогда
			
			ЗапроситьЯчейкуСсервера(Результат.Штрихкод);		
			
		ИначеЕсли СтатусРаботыСРазмещениемДокумента = "ВыборНоменклатуры" Тогда 
			
			ЭтаФорма.Штрихкод = Результат.Штрихкод;
			ЭтаФорма.ТоварГУИД = "";
			//Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, Объект.ЯчейкаПриемки);
			//Если Проверка Тогда
			//	
			//	ОбработатьЯчейкуДляЗакрытияПриемкиТовара();
			//	Возврат;
			//	
			//КонецЕсли; 
									
			ОбработкаОтсканированногоТовара();
								
		КонецЕсли; 
						
	КонецЕсли;
		                                                       
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаОтсканированногоТовара() Экспорт
	
	Оповестить("ГруппаПоискаТовара", Ложь);	
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();	
	Если РежимВводаАвтоматический Тогда
				
		Результат = ОбработкаШтрихкодаАвтоматический.ОбработкаШтрихкодаВАвтоматическомРежиме(ЭтаФорма, "ПоступлениеТоваровУслуг");		
		Если Результат = "ЗакрытиеЯчейкиПриемки" Тогда
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборЯчейки");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
			Возврат;
			
		ИначеЕсли Результат =  "ЯчейкаНеСоотвестЯчейкиПриемки" Тогда  
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
			Возврат;
			
		Иначе
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если Не РежимВводаАвтоматический Тогда	
		
		ЗаполнитьТЗРучнойНабор();
		Результат = ОбработкаШтрихкодаРучной.ОбработкаШтрихкодаВРучномРежиме(ЭтаФорма, "ПоступлениеТоваровУслуг");
		Если Результат = "ЗакрытиеЯчейкиПриемки" Тогда
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборЯчейки");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
			Возврат;
			
		ИначеЕсли Результат =  "ЯчейкаНеСоотвестЯчейкиПриемки" Тогда  
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
			Возврат;
			
		Иначе 
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВводКоличестваНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		

		КонецЕсли; 
	КонецЕсли; 	
	
	Если Результат = "НеизвестныйШтрихкод" Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Штрихкод", Штрихкод);                            
		Структура.Вставить("ЭтаФорма", ЭтаФорма);					
		// В методе ДиалогНеизвестныйШтрихкод используются "Показать предупреждения"
		//ПрисвоитьШтрихкод.ДиалогНеизвестныйШтрихкод(Структура);				
		
		ОбщегоНазначенияКлиент.ИнициализацияТЗ_Набрано(ЭтаФорма);
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ШКнеНайденВПоставке");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		
	//ИначеЕсли Результат = "НоменклатураСоШтрихкодомНеНайдена" Тогда 
	//	
	//	ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);	
	//	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
	//	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СоздатьДокументРазмещения();			
	
КонецПроцедуры

&НаКлиенте                                                                           
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда		
		Компонента.Отключить();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимВвода(Команда)
	
	ОбщегоНазначения.УстановитьРежимВводаНаСервере();
	ОбновитьСлуженоеСообщениеПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьЯчейкуСсервера(Текст)
	
	ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
	
	Результат = ОбщегоНазначения.ПолучитьЯчейку(Текст);                     
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
		ТекстОшибки = "Ячейка " + Текст + " некорректна !!!" + Символы.ПС;
		ТекстОшибки = ТекстОшибки + Результат.Ошибка;
		ПоказатьПредупреждение(,"Ошибка: " + ТекстОшибки, 3);	
		Объект.ЯчейкаПриемки = "";
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Результат.Данные) Тогда
		
		Объект.ЯчейкаПриемкиГУИД = Результат.Данные;
		Объект.ЯчейкаПриемки = Текст;				
		
		ПараметрыРаботы = ОбщегоНазначенияКлиент.СформироватьПараметрыДляФормы("ПриемкаКоллективная", Объект);
		ОбщегоНазначения.ЗаписатьПараметрыРаботы( "ПараметрыРаботыСДокументомПТУ", ПараметрыРаботы );			
		
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
		Оповестить("ДоступностьГруппыЯчейка", Новый Структура("Состояние", "ВыборНоменклатуры"));		
		Оповестить("ГруппаПоискаТовара", Истина);
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	Если ИмяСобытия = "СканированиеШтрихкода" Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
			Компонента.Отключить();
		Иначе
			Компонента.Подключить();
		КонецЕсли; 
		#КонецЕсли 	
		Возврат;		
	КонецЕсли; 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	Если ИмяСобытия = "ДоступностьГруппыЯчейка" Тогда	
	
		Если Параметр.Состояние = "ВыборЯчейки" Тогда
		
			Элементы.ЯчейкаПриемки.ТолькоПросмотр = Ложь;
			Элементы.ЯчейкаПриемки.Доступность = Истина;
			
			Элементы.ПоискЯчейки.Доступность = Истина;
			Элементы.ПоискЯчейки.Видимость = Истина;
			
		ИначеЕсли Параметр.Состояние = "ВыборНоменклатуры"  Тогда 
			
			Элементы.ЯчейкаПриемки.ТолькоПросмотр = Истина;
			Элементы.ЯчейкаПриемки.Доступность = Истина;
			
			Элементы.ПоискЯчейки.Доступность = Ложь;
			Элементы.ПоискЯчейки.Видимость = Ложь;
			
		КонецЕсли; 
		
		Возврат;
		
	КонецЕсли;
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	Если ИмяСобытия = "ВидимостьОписанияНайденногоТовара" Тогда
		
		Элементы.ГруппаОписаниеНайденногоТовара.Видимость = Параметр.ГруппаОписаниеНайденногоТовара;
		Элементы.ГруппаОписаниеНайденногоТовараПолное.Видимость = Параметр.ГруппаОписаниеНайденногоТовараПолное;
		Элементы.ГруппаОписаниеОшибки.Видимость = Параметр.ГруппаОписаниеОшибки;
		Возврат;
		
	КонецЕсли; 

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	Если ИмяСобытия = "ОбновитьГруппуОсталостьИНабрано" Тогда	
	
		РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокДокументовПТУ(, Объект.ДокументГУИД);	
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Возврат;
		КонецЕсли; 
		
		Запись = РезультатСтруктура.Данные[0];
		ЭтаФорма.Шапка.Очистить();
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ЗаголовокСкладскогоДокумента = "В работе";
		СтрокаТЗ.НомерСкладскогоДокумента = Объект.НомерСкладскогоДокумента;
		//ОсталосьЗначение = "осталось: " + Строка(Запись.КоличествоВПТУ - Запись.КоличествоВРазмещении);
		//НабраноЗначение  = "набрано: " + Строка(Запись.КоличествоСтрокВБуфереВсего);
		ОсталосьЗначение = "осталось строк: " + Строка(Запись.КоличествоОсталостьРазместитьСтрокНоменклатуры);
		НабраноЗначение  = "набрано: " + Строка(Запись.КоличествоСтрокВБуфереВсего);
		
		СтрокаТЗ.ОсталосьИНабрано = ОсталосьЗначение + "   " + НабраноЗначение;
		
		//+Кабанов А.В. 29.08.2025 # UT10-5361
		
		Если Запись.Свойство("ДокументТребуетсяМаркировка") Тогда 
			
			Если Запись.ДокументТребуетсяМаркировка Тогда
				
				ОсталосьМаркировок  = "осталось: " + Строка(Запись.КоличествоТоваровСМаркировкой - Запись.КоличествоОтсканированныхМаркировок);
				ВсегоМаркировок     = " из " + Строка(Запись.КоличествоТоваровСМаркировкой)  + " маркировок";
				
				СтрокаТЗ.ОписаниеСтатусаМаркировки = ОсталосьМаркировок + "  " + ВсегоМаркировок;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//-Кабанов А.В. 29.08.2025 # UT10-5361
		
		Возврат;
		
	КонецЕсли;
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	Если ИмяСобытия = "ГруппаПоискаТовара" Тогда
		
		Элементы.ГруппаПоискаТовара.Видимость = Параметр;
		ЭтаФорма.Поиск = "";
		Возврат;
		
	КонецЕсли; 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	

КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Поиск) Тогда
		Сообщить("Введите код производителя или штрихкод.");
		Возврат;
	КонецЕсли; 
		
	ЭтаФорма.Штрихкод = ЭтаФорма.Поиск;
	ЭтаФорма.ТоварГУИД = "";
				
	ОбработкаОтсканированногоТовара();			
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЯчейкуДляЗакрытияПриемкиТовара() Экспорт
	
	Объект.ЯчейкаПриемки = "";
	ЭтаФорма.Поиск = "";
	
	ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();         
	
	ПараметрыРаботы	= ОбщегоНазначенияКлиент.СформироватьПараметрыДляФормы("ПриемкаКоллективная", Объект);
	ПараметрыРаботы.Вставить("ЯчейкаПриемки", "");
	ПараметрыРаботы.Вставить("ЯчейкаПриемкиГУИД", "");		
	ОбщегоНазначения.ЗаписатьПараметрыРаботы( "ПараметрыРаботыСДокументомПТУ", ПараметрыРаботы );			
	
	
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборЯчейки");	
	ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);			
	Оповестить("ДоступностьГруппыЯчейка", Новый Структура("Состояние", "ВыборЯчейки"));
	Оповестить("ГруппаПоискаТовара", Ложь);
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСканирование(Команда)
	
	ЭтаФорма.ОписаниеОшибки = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";
	ЭтаФорма.Штрихкод = "";
	ЭтаФорма.Поиск = "";
	
	ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);	
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВводНоменклатуры");		
	ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);
	
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
	
	Оповестить("ГруппаПоискаТовара", Истина);
	Оповестить("СканированиеШтрихкода");	
	
КонецПроцедуры

// Вызов формы товары документа
&НаКлиенте                                        
Процедура ТоварыДокумента(Команда)
			
	Оповестить("СканированиеШтрихкода");	
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоВсемТоварамИзДокумента(Объект.ДокументГУИД);
	
	ЭтаФорма.Поиск = "";
	ЭтаФорма.Штрихкод = "";
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
			
	Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыТоварыДокумента", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументГУИД", Объект.ДокументГУИД);
	ИмяФормыВычисл = ПолучитьПолноеИмяФормы("ФормаТоварыДокумента");
	ОткрытьФорму(ИмяФормыВычисл, ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхПриЗакрытииФормыТоварыДокумента(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат <> Неопределено Тогда
		
		ЭтаФорма.Штрихкод = "";
		ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОсновная;
		ОбработкаОтсканированногоТовара();	
		
	КонецЕсли; 

КонецПроцедуры

Функция ПолучитьПолноеИмяФормы(ИмяФормы) 

Возврат Лев(ЭтаФорма.ИмяФормы, Найти(ЭтаФорма.ИмяФормы,".Форма.")+6) + ИмяФормы; 

КонецФункции

&НаКлиенте
Процедура Внести(Команда)
	
	ОбработкаШтрихкодаРучной.ОбработатьВведеноеКоличествоТовара(ЭтаФорма, "ПоступлениеТоваровУслуг");	
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументРазмещения() Экспорт
		
	РезультатСтруктура = ОбщегоНазначения.СоздатьДокуметРазмещенияПоЯчейкам(Объект.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		Если НЕ РезультатСтруктура.Ошибка = "Отсутствуют отсканированные строки документа" Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли; 
	
	ТекстСообщения = "Создан документ размещения по ячейкам № %1 %2. Документ проведен";
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			РезультатСтруктура.Данные.НомерДокумента,
			РезультатСтруктура.Данные.ДатаДокумента 
			);						
			
	ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаСпискаПТУ");			
	Оповестить("СообщениеСозданДокументРазмещенияПоЯчейкам", Новый Структура("ТекстСообщения", ТекстСообщения));	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланФакт(Команда)
		
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоВсемТоварамИзДокумента(Объект.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
			                                  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументГУИД", Объект.ДокументГУИД);
	ИмяФормыВычисл = ПолучитьПолноеИмяФормы("ФормаТоварыПланФакт");
	ОткрытьФорму(ИмяФормыВычисл, ПараметрыФормы, ЭтаФорма,,, , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискЯчейки(Команда)
	ЗапроситьЯчейкуСсервера(Элементы.ЯчейкаПриемки.ТекстРедактирования);
КонецПроцедуры

&НаКлиенте
Процедура ВключитьПоискТовара(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЯчейкаПриемки) Тогда
		ПоказатьПредупреждение(, "Нужнно ввести или отсканировать код ячейки.", 4);		
		Возврат;
	КонецЕсли;
		
	ЭтаФорма.ОписаниеОшибки = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";
	ЭтаФорма.Штрихкод = "";
	ЭтаФорма.Поиск = "";
	
	ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);		
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");		
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();	
	Оповестить("ГруппаПоискаТовара", Истина);	
	Оповестить("СканированиеШтрихкода");		
			
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаНеРазмещенныхТоваров" Тогда
		
		РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзБуфераРазмещения(Объект.ДокументГУИД);
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Закрыть();	
			Возврат;
		КонецЕсли; 
		
		Элементы.СписокТоваровВБуфереРазмещения.Обновить();
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокТоваровВБуфереРазмещенияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	Для Индекс = 0  По Ключи.Количество()-1 Цикл	
		
		СтрокаСписка = Строки[Ключи[Индекс]];
		СтрокаСписка.Данные["ОписаниеКоличества"] = "Кол.: " + Строка(СтрокаСписка.Данные["КоличествоТовара"]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров() Экспорт
	
	ОбновитьСлуженоеСообщениеПодвал();
	Элементы.Набрано.Обновить();
	Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_ОшибкаСканирования;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Истина;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Ложь;	
		
		Элементы.КнопкаПропустить.Видимость = Ложь;
		Элементы.КнопкаДобавитьШтрихкод.Видимость = Ложь;
		Элементы.КнопкаВыбратьТоварИзДокумента.Видимость = Ложь;
		
		Возврат;
	КонецЕсли; 
		
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();	
	Если РежимВводаАвтоматический И  ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента() <> "ШКнеНайденВПоставке" Тогда
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_АвтоматическийВвод;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Истина;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Ложь;			
		Элементы.ГруппаЯчейки.Видимость = Истина;

		Элементы.КнопкаПропустить.Видимость = Ложь;
		Элементы.КнопкаДобавитьШтрихкод.Видимость = Ложь;
		Элементы.КнопкаВыбратьТоварИзДокумента.Видимость = Ложь;	
		
	ИначеЕсли Не РежимВводаАвтоматический И ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента() = "ВводКоличестваНоменклатуры" Тогда 
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_РучнойВвод;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Истина;		
		Элементы.ГруппаЯчейки.Видимость = Ложь;

		Элементы.КнопкаПропустить.Видимость = Ложь;
		Элементы.КнопкаДобавитьШтрихкод.Видимость = Ложь;
		Элементы.КнопкаВыбратьТоварИзДокумента.Видимость = Ложь;
		
	ИначеЕсли Не РежимВводаАвтоматический И ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента() = "ВыборНоменклатуры" Тогда 
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_АвтоматическийВвод;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Истина;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Ложь;		
		Элементы.ГруппаЯчейки.Видимость = Истина;

		Элементы.КнопкаПропустить.Видимость = Ложь;
		Элементы.КнопкаДобавитьШтрихкод.Видимость = Ложь;
		Элементы.КнопкаВыбратьТоварИзДокумента.Видимость = Ложь;
				
	ИначеЕсли ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента() = "ШКнеНайденВПоставке" Тогда
		
		Элементы.ГруппаСтраницыРаботаСТоваров.ТекущаяСтраница = Элементы.ГруппаСтраница_ОтсутствиеШК_вПоставке;		
		Элементы.ГруппаСтраница_ОтсутствиеШК_вПоставке.Видимость = Истина;
		Элементы.ГруппаСтраница_АвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаСтраница_ОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаСтраница_РучнойВвод.Видимость = Ложь;		
		Элементы.ГруппаЯчейки.Видимость = Истина;

		Элементы.КнопкаПропустить.Видимость = Истина;
		Элементы.КнопкаДобавитьШтрихкод.Видимость = Истина;
		Элементы.КнопкаВыбратьТоварИзДокумента.Видимость = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры                                                                   

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	СтрокаТЗ.ОписаниеРежимаВводаКоличества = ОбщегоНазначенияКлиент.ПолучитьОтображениеОРежимеВводеКоличества();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = ОбщегоНазначения.ПолучитьИнструкциюДействийДляПользователя(ЭтаФорма.ОписаниеОшибки);
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры
  
&НаКлиенте
Процедура ДекорацияКнопкаВлевоНажатие(Элемент)

	Если ЭтаФорма.ВведенноеКоличествоВРучную > 0 Тогда
		ЭтаФорма.ВведенноеКоличествоВРучную = ЭтаФорма.ВведенноеКоличествоВРучную - 1;	
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКнопкаВправоНажатие(Элемент)
	
	ЭтаФорма.ВведенноеКоличествоВРучную = ЭтаФорма.ВведенноеКоличествоВРучную + 1;	

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхПриЗакрытииФормыВводКоличестваВРучную(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат.ВведеноеКоличествоВРучную = 0 Тогда
		Количество = 1;
	Иначе 
		Количество = Результат.ВведеноеКоличествоВРучную;
	КонецЕсли; 
	
	РучнойВводКоличества[0].ВведенноеКоличествоВРучную = Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВнестиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаОКТекст" Тогда
		
		ОбработкаШтрихкодаРучной.ОбработатьВведеноеКоличествоТовара(ЭтаФорма, "ПоступлениеТоваровУслуг");	
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура РучнойВводКоличестваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РучнойВводКоличестваЗнакМеньше" Тогда
		
		Если РучнойВводКоличества[0].ВведенноеКоличествоВРучную > 1 Тогда
			РучнойВводКоличества[0].ВведенноеКоличествоВРучную = РучнойВводКоличества[0].ВведенноеКоличествоВРучную - 1;	
		КонецЕсли; 
				
	ИначеЕсли Поле.Имя = "РучнойВводКоличестваЗнакБольше" Тогда 
		
		РучнойВводКоличества[0].ВведенноеКоличествоВРучную = РучнойВводКоличества[0].ВведенноеКоличествоВРучную + 1;	
		
	ИначеЕсли Поле.Имя = "ВведенноеКоличествоВРучную" Тогда 
		
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыВводКоличестваВРучную", ЭтаФорма);				
		ПараметрыФормы = Новый Структура("Количество", РучнойВводКоличества[0].ВведенноеКоличествоВРучную);
		ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаВводКоличестваВРучную", ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПодвалВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПодвалОписаниеРежимаВводаКоличества" Тогда
		
		ОбщегоНазначения.УстановитьРежимВводаНаСервере();
		ОбновитьСлуженоеСообщениеПодвал();

	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КнопкаПропуститьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаПропуститьПропустить" Тогда
				 
		ЭтаФорма.ОписаниеОшибки = "";
		ЭтаФорма.ОписаниеНайденногоТовара =  "";
		ЭтаФорма.Штрихкод = "";
		ЭтаФорма.Поиск = "";
	
		ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);			
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхДляПрисвоенияШК_ПриЗакрытииФормыТоварыДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
						
		ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;
		РезультатСтруктура = ОбщегоНазначения.ПрисвоитьШтрихкодТовару(ЭтаФорма.Штрихкод, ЭтаФорма.ТоварГУИД);
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 5);	
			ЭтаФорма.ОписаниеОшибки = "";
			ЭтаФорма.ОписаниеНайденногоТовара =  "";
			ЭтаФорма.Штрихкод = "";
			ЭтаФорма.Поиск = "";
	
			ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		

			Возврат;
			
		Иначе 
			ПоказатьПредупреждение(,"Штрихкод " + Строка(ЭтаФорма.Штрихкод) + " добавлен.", 5);	
		КонецЕсли; 			
		
		ОбработкаОтсканированногоТовара();
		
	Иначе 
				
		ЭтаФорма.ОписаниеОшибки = "";
		ЭтаФорма.ОписаниеНайденногоТовара =  "";
		ЭтаФорма.Штрихкод = "";
		ЭтаФорма.Поиск = "";
	
		ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);			
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьШтрихкодВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаДобавитьШтрихкодДобавитьШтрихкод" Тогда
		                                                      
		РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоВсемТоварамИзДокумента(Объект.ДокументГУИД);
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Возврат;
		КонецЕсли; 
				
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхДляПрисвоенияШК_ПриЗакрытииФормыТоварыДокумента", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДокументГУИД", Объект.ДокументГУИД);
		ПараметрыФормы.Вставить("СобытиеПрисвоитьШтрихкод", Истина);
		
		ИмяФормыВычисл = ПолучитьПолноеИмяФормы("ФормаТоварыДокумента");
		ОткрытьФорму(ИмяФормыВычисл, ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();

	КонецЕсли; 	
	
КонецПроцедуры
 
&НаКлиенте
Процедура КнопкаВыбратьТоварИзДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаВыбратьТоварИзДокументаВыбратьТовар" Тогда
		
		РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоВсемТоварамИзДокумента(Объект.ДокументГУИД);
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Возврат;
		КонецЕсли; 
		
		Оповестить("СканированиеШтрихкода");	
		
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыТоварыДокумента", ЭтаФорма);		
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДокументГУИД", Объект.ДокументГУИД);
		ПараметрыФормы.Вставить("СобытиеПрисвоитьШтрихкод", Ложь);
		
		ИмяФормыВычисл = ПолучитьПолноеИмяФормы("ФормаТоварыДокумента");
		ОткрытьФорму(ИмяФормыВычисл, ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
				
	КонецЕсли;

КонецПроцедуры
